### Ingest data from College dataset

In [1]:
dataset_id = "college_staging"
!bq --location=US mk --dataset {dataset_id}

BigQuery error in mk operation: Dataset 'studied-brand-266702:college_staging'
already exists.

In [2]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {dataset_id}.Classes 'gs://cs327e-collegedata-315/Classes.csv'

Waiting on bqjob_r3b2f52eb4e4fb010_000001700dc55cda_1 ... (1s) Current status: DONE

In [3]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {dataset_id}.Current_Students 'gs://cs327e-collegedata-315/Current_Students.csv'

Waiting on bqjob_rd80f4b7c2791511_000001700dc56dad_1 ... (2s) Current status: DONE

In [4]:
!bq --location=US load --autodetect --skip_leading_rows=1 \
--source_format=CSV {dataset_id}.New_Students 'gs://cs327e-collegedata-315/New_Students.csv'

Waiting on bqjob_r314251d49b45a3ef_000001700dc57f45_1 ... (3s) Current status: DONE

### Get record count for all tables

In [6]:
%%bigquery
select count(*) as count from college_staging.Classes

   count
0     26

In [7]:
%%bigquery
select count(*) as count from college_staging.Current_Students

   count
0     13

In [8]:
%%bigquery
select count(*) as count from college_staging.New_Students

   count
0      7

### Read sample from records

In [9]:
%%bigquery
select * from college_staging.Classes
limit 5

,tid,instructor,dept,cno,cname,credits
0,fares,Fares Fraij,CS,CS331E,Elements of Software Engineering,3
1,abraham,Prof. Sarah Abraham,CS,CS329E,Elements of Mobile Computing,3
2,mitra,"Mitra, Shyamal",CS,CS313E,Elements of Software Design,3
3,cannata,PHILIP CANNATA,CS,CS326E,Elements of Networking,3
4,cannata,"Cannata, Philip",CS,CS347,Data Management,3

In [10]:
%%bigquery
select * from college_staging.Current_Students
limit 5

,sid,fname,lname,dob,cno,cname,credits,grade
0,kev18,Kevin,Lin,05/10/1999,CS329E,Elements of Web Programming,3,None
1,paulg,Paul,Gore,2000-09-17,CS329E,Elements of Web Programming,3,A
2,paulg,Paul,Gore,2000-09-17,CS326E - Fall18,Elements of Networking,3,A-
3,paulg,Paul,Gore,09/17/2000,CS313E,Elements of Software Design,3,None
4,bzen26,Biswa,Zen,04/22/1998,CS313E - Fall18,Elements of Software Design,3,B+

In [11]:
%%bigquery
select * from college_staging.New_Students
limit 5

        sid    fname     lname         dob
0    aprilz    April     Lopez  2000-01-10
1  sudeepa4  Sudeepa       Roy  2000-10-01
2    ryan22     Ryan    Watson  2000-11-07
3     dchen    David      Chen  2000-08-22
4     natea   Nathan  Anderson  2000-04-08

In [16]:
%%bigquery
select count (*) as count from college_staging.Current_Students where cno='CS327E' or cno='CS329E'

   count
0      6

In [17]:
%%bigquery
select * from college_staging.Current_Students where cno='CS327E' or cno='CS329E'

,sid,fname,lname,dob,cno,cname,credits,grade
0,kev18,Kevin,Lin,05/10/1999,CS329E,Elements of Web Programming,3,None
1,paulg,Paul,Gore,2000-09-17,CS329E,Elements of Web Programming,3,A
2,jerryh,Jerry,Hargrove,01/03/1999,CS327E,Elements of Databases,3,B
3,jerryh,Jerry,Hargrove,01/03/1999,CS327E,Elements of Databases,0,None
4,jerryh,Jerry,Hargrove,1999-01-03,CS329E,Elements of Web Programming,3,A-
5,jc,James,Cowe,2000-04-22,CS327E,CS327E – Elements of Databases,3,None

In [19]:
%%bigquery
select * from college_staging.Current_Students where cno='CS327E' and cno='CS329E'
# WRONG - use join or subquery

Empty DataFrame
Columns: [sid, fname, lname, dob, cno, cname, credits, grade]
Index: []